"Bass Frequency" = "Basfrekvens"; 
"Bass Gain" = "Basforstærkning"; 
"Low Mid Frequency" = "Lav mellemfrekvens";
"Low Mid Gain" = "Lav mellemforstærkning";
"High Mid Frequency" = "Høj mellemfrekvens";
"High Mid Gain" = "Høj mellemforstærkning";
"Treble Frequency" = "Diskantfrekvens";
"Treble Gain" = "Diskantforstærkning";
